package oop0521;

public class Test03_Quiz {

	public static void main(String[] args) {
		// 반복문 연습문제
		
		
		// 문1) 
		/*
		 * @★★★
		 * ★@★★
		 * ★★@★
		 * ★★★@
		 * 
		 */
		
		for(int a=1;a<=4;a++){
			for(int b=1;b<=4;b++){
				
			  if(b==a){
				  System.out.print("@");
			  }else{
				  System.out.print("★");
			  }
				
			}
			System.out.println();
		}//

		
		
//-----------------------------------------------------------------------------------------------		
		
		
		/*
		 * 문2)
		 * 
		 * ★★★★
		 *  ★★ ★
		 *    ★★
		 *     ★
		 * 
		 * 안보이는 곳을 공백으로 설정.
		 */
		
		for(int x=1;x<=4;x++){
			for(int y=1;y<=4;y++){
				
				if(y<=x-1){
					System.out.print(" ");
				}else{
					System.out.print("*");
				}

			}
			System.out.println();
		}
		
		/*
		 * x=1    if(1<=0)  > 맞지않음
                  y=1   1<=4  ★
		 *               2<=4  ★
		 *               3<=4  ★
		 *               4<=4  ★ 
		 *               
		 * x=2     if(1<=1)  y=1  1<=4  " "(공백)
		 *         if(2<=1) 맞지않음 2<=4   ★
		 *         if(3<=1) 맞지않음 3<=4   ★
		 *         if(4<=1) 맞지않음 4<=4   ★     
		 * 
		 *             
		 */
		
		
		
//------------------------------------------------------------------------------------------------------
		
		/*
		 * 
		 * 문3)
		 * 12345
		 * 23456
		 * 34567
		 * 45678
		 * 56789
		 * 
		 */
		
		for(int n=1;n<=5;n++){
			for(int m=n;m<n+5;m++){
				System.out.print(m);
			}
			System.out.println();
		}
		
		/*
		 * 분석
		 * 
		 * n=1     m=1   1<6      12345
		 * n=2     m=2   2<7      23456
		 * n=3     m=3   3<8      34567
		 * 
		 */
		
		//선생님이 하신것.
		for(int h=0;h<5;h++){
			for(int j=h+1;j<=h+5;j++){
				System.out.print(j);
			}
			System.out.println();
		}
		
//------------------------------------------------------------------------------------------------------
				
		
		/*
		 * 문4)
		 * 2g, 3g, 5g짜리 추가 각각 5개씩 있을 때 세가지의 추의 조합으로
		 * 무게가 40~45 사이일 때, 각 추의 갯수와 무게를 출력하는 프로그램
		 * 
		 * 출력결과
		 * 2g 3g 5g  total
		 * 1   5  5   42
		 * 2   4  5   41
		 * 2   5  5   44
		 * 
		 */
		
		//선생님이 한것.
		
		System.out.println("2g 3g 5g total");
		int hap=0;
		for(int t=1;t<=5;t++){ //2g추
			for(int i=1;i<=5;i++){ //3g추
				for(int f=1;f<=5;f++){ //5g추
					hap=(t*2)+(i*3)+(f*5); //각 추의 합.
					if(hap>=40&&hap<=45){
						System.out.println(t+" "+i+" "+f+" "+hap);
					}//
				}//
			}//
		}//
		 
		
		
		
		
		
		
		
		
		

	}//main

}//class
